<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <meta http-equiv="Content-Type"
 content="text/html; charset=iso-8859-1">
  <meta name="Author" content="Michael Margraf">
  <title>Qucs - &#1055;&#1077;&#1088;&#1074;&#1099;&#1077; &#1096;&#1072;&#1075;&#1080;</title>
</head>
<body>
<a name="top" id="top"></a>
<center>
<h3>- Qucs -<br>
&#1055;&#1086;&#1095;&#1090;&#1080; &#1091;&#1085;&#1080;&#1074;&#1077;&#1088;&#1089;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1089;&#1080;&#1084;&#1091;&#1083;&#1103;&#1090;&#1086;&#1088; &#1094;&#1077;&#1087;&#1077;&#1081;<br>
</h3>
<h1>&#1055;&#1077;&#1088;&#1074;&#1099;&#1077; &#1096;&#1072;&#1075;&#1080; &#1074;<br>
&#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1084; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080;<br>
<br>
</h1>
</center>
Qucs (&#1087;&#1088;&#1086;&#1080;&#1079;&#1085;&#1086;&#1089;&#1080;&#1090;&#1089;&#1103;: kju:ks) - &#1089;&#1080;&#1084;&#1091;&#1083;&#1103;&#1090;&#1086;&#1088; &#1094;&#1077;&#1087;&#1077;&#1081; &#1089; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084;
&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1084; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1086;&#1084;. &#1054;&#1085; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1077;&#1085; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1090;&#1100; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1077; &#1074;&#1080;&#1076;&#1099;
&#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1085;&#1072; &#1087;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1085;&#1086;&#1084; &#1090;&#1086;&#1082;&#1077;, S-&#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1080; &#1090;.&#1076;.).
&#1069;&#1090;&#1086;&#1090; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090; &#1076;&#1072;&#1077;&#1090; &#1082;&#1088;&#1072;&#1090;&#1082;&#1086;&#1077; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1082;&#1072;&#1082; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; Qucs.
<br>
<br>
&#1055;&#1088;&#1080; &#1087;&#1077;&#1088;&#1074;&#1086;&#1084; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1077; Qucs &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090; &#1087;&#1072;&#1087;&#1082;&#1091; ".qucs" &#1074; &#1042;&#1072;&#1096;&#1077;&#1081; &#1076;&#1086;&#1084;&#1072;&#1096;&#1085;&#1077;&#1081; &#1087;&#1072;&#1087;&#1082;&#1077;.
&#1050;&#1072;&#1078;&#1076;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074; &#1101;&#1090;&#1086;&#1081; &#1087;&#1072;&#1087;&#1082;&#1077; &#1080;&#1083;&#1080; &#1074; &#1086;&#1076;&#1085;&#1086;&#1081; &#1080;&#1079; &#1077;&#1077; &#1087;&#1086;&#1076;&#1087;&#1072;&#1087;&#1086;&#1082;.
&#1055;&#1086;&#1089;&#1083;&#1077; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1080; Qucs &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1075;&#1083;&#1072;&#1074;&#1085;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1080;&#1090;
&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1085;&#1086; &#1082;&#1072;&#1082; &#1085;&#1072; &#1088;&#1080;&#1089;.1. &#1057; &#1087;&#1088;&#1072;&#1074;&#1086;&#1081; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1099; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1072; &#1088;&#1072;&#1073;&#1086;&#1095;&#1072;&#1103; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100;
(6), &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1089;&#1103; &#1089;&#1093;&#1077;&#1084;&#1099;, &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080; &#1090;.&#1076;.. &#1057;
&#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1074;&#1082;&#1083;&#1072;&#1076;&#1086;&#1082; (5) &#1085;&#1072;&#1076; &#1101;&#1090;&#1086;&#1081; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100;&#1102; &#1084;&#1086;&#1078;&#1085;&#1086; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086; &#1087;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100;&#1089;&#1103; &#1085;&#1072;
&#1083;&#1102;&#1073;&#1086;&#1081; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;, &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1081; &#1074; &#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090;. &#1057; &#1083;&#1077;&#1074;&#1086;&#1081; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1099; &#1075;&#1083;&#1072;&#1074;&#1085;&#1086;&#1075;&#1086; &#1086;&#1082;&#1085;&#1072;
Qucs
&#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1077;&#1097;&#1077; &#1086;&#1076;&#1085;&#1072; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; (1), &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1090; &#1086;&#1090; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103;
&#1074;&#1082;&#1083;&#1072;&#1076;&#1086;&#1082;, &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1099;&#1093; &#1085;&#1072;&#1076; &#1085;&#1077;&#1081;:
"&#1055;&#1088;&#1086;&#1077;&#1082;&#1090;&#1099;" (2), "&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;" (3) &#1080; "&#1050;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099;" (4). &#1055;&#1086;&#1089;&#1083;&#1077; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072; Qucs
&#1072;&#1082;&#1090;&#1080;&#1074;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1072;&nbsp; "&#1055;&#1088;&#1086;&#1077;&#1082;&#1090;&#1099;"
(2). &#1058;&#1072;&#1082; &#1082;&#1072;&#1082; &#1042;&#1099; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1083;&#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1091; &#1074; &#1087;&#1077;&#1088;&#1074;&#1099;&#1081; &#1088;&#1072;&#1079;,
&#1101;&#1090;&#1072; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; &#1087;&#1091;&#1089;&#1090;&#1072;&#1103;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1091; &#1042;&#1072;&#1089; &#1077;&#1097;&#1077; &#1085;&#1077;&#1090; &#1085;&#1080; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;. &#1053;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077;
&#1082;&#1085;&#1086;&#1087;&#1082;&#1091; "&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100;" &#1087;&#1088;&#1103;&#1084;&#1086; &#1085;&#1072;&#1076; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100;&#1102; (1) &#1080; &#1086;&#1090;&#1082;&#1088;&#1086;&#1077;&#1090;&#1089;&#1103; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086;.
&#1042;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077; &#1080;&#1084;&#1103; &#1076;&#1083;&#1103; &#1042;&#1072;&#1096;&#1077;&#1075;&#1086; &#1087;&#1077;&#1088;&#1074;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, "firstProject" &#1080;
&#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091;&nbsp; "&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100;". Qucs &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090; &#1087;&#1072;&#1087;&#1082;&#1091; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1074; &#1087;&#1072;&#1087;&#1082;&#1077;
~/.qucs, &#1076;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1072;
"firstProject_prj". &#1050;&#1072;&#1078;&#1076;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083;, &#1087;&#1088;&#1080;&#1085;&#1072;&#1076;&#1083;&#1077;&#1078;&#1072;&#1097;&#1080;&#1081; &#1101;&#1090;&#1086;&#1084;&#1091; &#1085;&#1086;&#1074;&#1086;&#1084;&#1091; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1091;,
&#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085; &#1074; &#1101;&#1090;&#1086;&#1081; &#1087;&#1072;&#1087;&#1082;&#1077;. &#1053;&#1086;&#1074;&#1099;&#1081; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090; &#1085;&#1077;&#1084;&#1077;&#1076;&#1083;&#1077;&#1085;&#1085;&#1086; &#1086;&#1090;&#1082;&#1088;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; (&#1101;&#1090;&#1086;
&#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072;&#1090;&#1100; &#1074; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1077; &#1086;&#1082;&#1085;&#1072;) &#1080; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1080; &#1087;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1072;&#1102;&#1090;&#1089;&#1103; &#1085;&#1072;
"&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;" (3), &#1075;&#1076;&#1077; &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086;&#1075;&#1086; &#1074; &#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090;
&#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;. &#1059; &#1042;&#1072;&#1089; &#1077;&#1097;&#1077; &#1085;&#1077;&#1090; &#1085;&#1080; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091;
&#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1085;&#1072; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; (&#1080;&#1083;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1075;&#1083;&#1072;&#1074;&#1085;&#1086;&#1077; &#1084;&#1077;&#1085;&#1102;:
&#1060;&#1072;&#1081;&#1083;-&gt;&#1057;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100;) &#1095;&#1090;&#1086;&#1073;&#1099; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090; &#1073;&#1077;&#1079; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081;
&#1079;&#1072;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090; &#1088;&#1072;&#1073;&#1086;&#1095;&#1091;&#1102; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; (6). &#1055;&#1086;&#1089;&#1083;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1087;&#1086;&#1103;&#1074;&#1080;&#1090;&#1089;&#1103; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086; &#1076;&#1083;&#1103;
&#1074;&#1074;&#1086;&#1076;&#1072; &#1080;&#1084;&#1077;&#1085;&#1080; &#1085;&#1086;&#1074;&#1086;&#1075;&#1086; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;.
&#1042;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077; "firstSchematic" &#1080; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; "&#1057;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100;".
<br>
<br>
<center>
<img src="qucsmain.png"><br>
&#1056;&#1080;&#1089;. 1 - &#1043;&#1083;&#1072;&#1074;&#1085;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086; Qucs<br>
<br>
</center>
<br>
&#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1085;&#1072;&#1084; &#1085;&#1091;&#1078;&#1085;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1077; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1085;&#1072; &#1087;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1085;&#1086;&#1084; &#1090;&#1086;&#1082;&#1077;, &#1090;&#1086;
&#1077;&#1089;&#1090;&#1100; &#1084;&#1099; &#1093;&#1086;&#1090;&#1080;&#1084; &#1087;&#1088;&#1086;&#1072;&#1085;&#1072;&#1083;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1093;&#1077;&#1084;&#1091; &#1085;&#1072; &#1088;&#1080;&#1089;. 1. &#1042;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1091;
"&#1050;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099;" ( (4) &#1085;&#1072; &#1088;&#1080;&#1089;. 1). &#1058;&#1072;&#1084; &#1042;&#1099; &#1091;&#1074;&#1080;&#1076;&#1080;&#1090;&#1077; &#1074;&#1099;&#1087;&#1072;&#1076;&#1072;&#1102;&#1097;&#1080;&#1081; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082;, &#1074;
&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1099;&#1073;&#1088;&#1072;&#1090;&#1100; &#1075;&#1088;&#1091;&#1087;&#1087;&#1091; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074; &#1080;, &#1085;&#1080;&#1078;&#1077;, &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1086;&#1081;
&#1075;&#1088;&#1091;&#1087;&#1087;&#1099;. &#1042;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; "&#1076;&#1080;&#1089;&#1082;&#1088;&#1077;&#1090;&#1085;&#1099;&#1077; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099;" &#1080; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1085;&#1072; &#1087;&#1077;&#1088;&#1074;&#1099;&#1081; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;:
"&#1056;&#1077;&#1079;&#1080;&#1089;&#1090;&#1086;&#1088;".
&#1055;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1072;&#1103; &#1082;&#1091;&#1088;&#1089;&#1086;&#1088; &#1084;&#1099;&#1096;&#1080; &#1074; &#1088;&#1072;&#1073;&#1086;&#1095;&#1091;&#1102; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; (6), &#1042;&#1099; &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089;&#1080;&#1090;&#1077; &#1088;&#1080;&#1089;&#1091;&#1085;&#1086;&#1082;
&#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1088;&#1077;&#1079;&#1080;&#1089;&#1090;&#1086;&#1088;&#1072;. &#1053;&#1072;&#1078;&#1072;&#1090;&#1080;&#1077; &#1087;&#1088;&#1072;&#1074;&#1086;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1084;&#1099;&#1096;&#1080; &#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;,
&#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1077; &#1083;&#1077;&#1074;&#1086;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1084;&#1099;&#1096;&#1080; &#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1077;&#1090; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; &#1085;&#1072; &#1089;&#1093;&#1077;&#1084;&#1091;. &#1055;&#1086;&#1074;&#1090;&#1086;&#1088;&#1080;&#1090;&#1077; &#1101;&#1090;&#1086;&#1090;
&#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089; &#1076;&#1083;&#1103; &#1074;&#1089;&#1077;&#1093; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1093; &#1085;&#1072; &#1088;&#1080;&#1089;. 1. &#1048;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082; &#1085;&#1072;&#1087;&#1088;&#1103;&#1078;&#1077;&#1085;&#1080;&#1103;
&#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1085;&#1072;&#1081;&#1076;&#1077;&#1085; &#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1077; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074; "&#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1080;", &#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;
&#1079;&#1072;&#1079;&#1077;&#1084;&#1083;&#1077;&#1085;&#1080;&#1103; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1074;&#1079;&#1103;&#1090;&#1086; &#1080;&#1079; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; "&#1076;&#1080;&#1089;&#1082;&#1088;&#1077;&#1090;&#1085;&#1099;&#1077; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099;" &#1080;&#1083;&#1080; &#1089;
&#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1084;&#1086;&#1077; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102;
&#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1093; &#1073;&#1083;&#1086;&#1082;&#1086;&#1074; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1085;&#1072;&#1093;&#1086;&#1076;&#1103;&#1097;&#1080;&#1093;&#1089;&#1103; &#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1077; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074; "&#1074;&#1080;&#1076;&#1099;
&#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;". &#1063;&#1090;&#1086;&#1073;&#1099; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1074;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1088;&#1077;&#1079;&#1080;&#1089;&#1090;&#1086;&#1088;&#1072;, &#1089;&#1076;&#1077;&#1083;&#1072;&#1081;&#1090;&#1077;
&#1076;&#1074;&#1086;&#1081;&#1085;&#1086;&#1077; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1077; &#1083;&#1077;&#1074;&#1086;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1084;&#1099;&#1096;&#1080; &#1085;&#1072; &#1085;&#1077;&#1084;. &#1054;&#1090;&#1082;&#1088;&#1086;&#1077;&#1090;&#1089;&#1103; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086;,
&#1075;&#1076;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1089;&#1086;&#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;. &#1042;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077; "100 Ohm" &#1074; &#1087;&#1086;&#1083;&#1077;
&#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089;&#1087;&#1088;&#1072;&#1074;&#1072; &#1080; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; Enter.
<br>
<br>
&#1063;&#1090;&#1086;&#1073;&#1099; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1080;&#1090;&#1100; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099;, &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1089; &#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1085;&#1080;&#1082;&#1086;&#1084; &#1085;&#1072; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080;
&#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; (&#1080;&#1083;&#1080; &#1074;&#1086;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077;&#1089;&#1100; &#1075;&#1083;&#1072;&#1074;&#1085;&#1099;&#1084; &#1084;&#1077;&#1085;&#1102;: &#1042;&#1089;&#1090;&#1072;&#1074;&#1082;&#1072;-&gt;&#1055;&#1088;&#1086;&#1074;&#1086;&#1076;&#1085;&#1080;&#1082;).
&#1055;&#1077;&#1088;&#1077;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1077; &#1082;&#1091;&#1088;&#1089;&#1086;&#1088; &#1085;&#1072; &#1085;&#1077;&#1079;&#1072;&#1085;&#1103;&#1090;&#1099;&#1081; &#1074;&#1099;&#1074;&#1086;&#1076; (&#1087;&#1086;&#1084;&#1077;&#1095;&#1077;&#1085;&#1085;&#1099;&#1081; &#1084;&#1072;&#1083;&#1077;&#1085;&#1100;&#1082;&#1080;&#1084; &#1082;&#1088;&#1072;&#1089;&#1085;&#1099;&#1084;
&#1082;&#1088;&#1091;&#1078;&#1082;&#1086;&#1084;).
&#1053;&#1072;&#1078;&#1072;&#1090;&#1080;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1084;&#1099;&#1096;&#1080; &#1085;&#1072; &#1085;&#1077;&#1084; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1077;&#1090; &#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1085;&#1080;&#1082;. &#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1087;&#1077;&#1088;&#1077;&#1076;&#1074;&#1080;&#1085;&#1100;&#1090;&#1077;
&#1082;&#1091;&#1088;&#1089;&#1086;&#1088; &#1082; &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;&#1081; &#1090;&#1086;&#1095;&#1082;&#1077; &#1080; &#1089;&#1085;&#1086;&#1074;&#1072; &#1085;&#1072;&#1078;&#1080;&#1090;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1084;&#1099;&#1096;&#1080;. &#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099;
&#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1099;. &#1045;&#1089;&#1083;&#1080; &#1042;&#1099; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1080;&#1079;&#1075;&#1080;&#1073;&#1072; &#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1085;&#1080;&#1082;&#1072;,
&#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1087;&#1088;&#1072;&#1074;&#1091;&#1102; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1084;&#1099;&#1096;&#1080;, &#1087;&#1088;&#1077;&#1078;&#1076;&#1077; &#1095;&#1077;&#1084; &#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1091;&#1102; &#1090;&#1086;&#1095;&#1082;&#1091;. &#1042;&#1099;
&#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1090;&#1072;&#1082;&#1078;&#1077; &#1079;&#1072;&#1082;&#1086;&#1085;&#1095;&#1080;&#1090;&#1100; &#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1085;&#1080;&#1082;, &#1085;&#1077; &#1085;&#1072;&#1078;&#1080;&#1084;&#1072;&#1103; &#1085;&#1080; &#1085;&#1072; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1099;&#1081; &#1074;&#1099;&#1074;&#1086;&#1076;, &#1085;&#1080;
&#1085;&#1072; &#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1085;&#1080;&#1082;:
&#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1081;&#1090;&#1077; &#1076;&#1074;&#1086;&#1081;&#1085;&#1086;&#1077; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1077; &#1083;&#1077;&#1074;&#1086;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1084;&#1099;&#1096;&#1080;.
<br>
<br>
&#1053;&#1072;&#1082;&#1086;&#1085;&#1077;&#1094;, &#1086;&#1095;&#1077;&#1085;&#1100; &#1074;&#1072;&#1078;&#1085;&#1086; &#1087;&#1086;&#1084;&#1077;&#1090;&#1080;&#1090;&#1100; &#1091;&#1079;&#1077;&#1083;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1042;&#1099; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077;, &#1095;&#1090;&#1086;&#1073;&#1099; Qucs
&#1088;&#1072;&#1089;&#1089;&#1095;&#1080;&#1090;&#1072;&#1083; &#1085;&#1072;&#1087;&#1088;&#1103;&#1078;&#1077;&#1085;&#1080;&#1077;.
&#1053;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1085;&#1072; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1076;&#1083;&#1103; &#1084;&#1077;&#1090;&#1082;&#1080; &#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1085;&#1080;&#1082;&#1072; (&#1080;&#1083;&#1080;
&#1074;&#1086;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077;&#1089;&#1100; &#1084;&#1077;&#1085;&#1102;: &#1042;&#1089;&#1090;&#1072;&#1074;&#1082;&#1072;-&gt;&#1052;&#1077;&#1090;&#1082;&#1072; &#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1085;&#1080;&#1082;&#1072;). &#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077;
&#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1084;&#1099;&#1096;&#1080; &#1085;&#1072; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1086;&#1084; &#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1085;&#1080;&#1082;&#1077;. &#1054;&#1090;&#1082;&#1088;&#1086;&#1077;&#1090;&#1089;&#1103; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086; &#1080; &#1084;&#1086;&#1078;&#1085;&#1086;
&#1074;&#1074;&#1077;&#1089;&#1090;&#1080; &#1080;&#1084;&#1103; &#1091;&#1079;&#1083;&#1072;. &#1053;&#1072;&#1087;&#1080;&#1096;&#1080;&#1090;&#1077;
"divide" &#1080; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; "Ok". &#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1089;&#1093;&#1077;&#1084;&#1072; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1077;&#1090;&#1100; &#1082;&#1072;&#1082; &#1085;&#1072;
&#1088;&#1080;&#1089;. 1.
<br>
<br>
&#1044;&#1083;&#1103; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1085;&#1072; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080;
&#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; (&#1080;&#1083;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077; &#1084;&#1077;&#1085;&#1102;: &#1052;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;-&gt;&#1052;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;).
&#1054;&#1090;&#1082;&#1088;&#1086;&#1077;&#1090;&#1089;&#1103; &#1086;&#1082;&#1085;&#1086; &#1080; &#1087;&#1086;&#1082;&#1072;&#1078;&#1077;&#1090; &#1087;&#1088;&#1086;&#1076;&#1074;&#1080;&#1078;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1072;. &#1055;&#1086;&#1089;&#1083;&#1077; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086;&#1075;&#1086;
&#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1080;&#1103; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1086;&#1090;&#1082;&#1088;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1054;&#1073;&#1099;&#1095;&#1085;&#1086; &#1074;&#1089;&#1077;
&#1101;&#1090;&#1086; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090; &#1090;&#1072;&#1082; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086;, &#1095;&#1090;&#1086; &#1042;&#1099; &#1091;&#1074;&#1080;&#1076;&#1080;&#1090;&#1077; &#1083;&#1080;&#1096;&#1100; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086;&#1077; &#1084;&#1077;&#1083;&#1100;&#1082;&#1072;&#1085;&#1080;&#1077;.
&#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1042;&#1072;&#1084; &#1085;&#1091;&#1078;&#1085;&#1086; &#1087;&#1086;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1076;&#1080;&#1072;&#1075;&#1088;&#1072;&#1084;&#1084;&#1091;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1074;&#1080;&#1076;&#1077;&#1090;&#1100; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1099;
&#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;. &#1057;&#1083;&#1077;&#1074;&#1072; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1082;&#1083;&#1072;&#1089;&#1089; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074; "&#1076;&#1080;&#1072;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;", &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081;
&#1074;&#1099;&#1073;&#1080;&#1088;&#1072;&#1077;&#1090;&#1089;&#1103; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;. &#1053;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1085;&#1072; "&#1058;&#1072;&#1073;&#1083;&#1080;&#1095;&#1085;&#1072;&#1103;", &#1087;&#1077;&#1088;&#1077;&#1081;&#1076;&#1080;&#1090;&#1077; &#1074; &#1088;&#1072;&#1073;&#1086;&#1095;&#1091;&#1102;
&#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; &#1080; &#1087;&#1086;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1077; &#1077;&#1077;, &#1085;&#1072;&#1078;&#1072;&#1074; &#1083;&#1077;&#1074;&#1091;&#1102; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1084;&#1099;&#1096;&#1080;.
&#1054;&#1090;&#1082;&#1088;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086;, &#1075;&#1076;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1099;&#1073;&#1088;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1074;
&#1085;&#1086;&#1074;&#1086;&#1081; &#1076;&#1080;&#1072;&#1075;&#1088;&#1072;&#1084;&#1084;&#1077;. &#1042; &#1083;&#1077;&#1074;&#1086;&#1081; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1074;&#1080;&#1076;&#1085;&#1086; &#1080;&#1084;&#1103; &#1091;&#1079;&#1083;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1042;&#1099; &#1079;&#1072;&#1076;&#1072;&#1083;&#1080;:
"divide". &#1057;&#1076;&#1077;&#1083;&#1072;&#1081;&#1090;&#1077; &#1076;&#1074;&#1086;&#1081;&#1085;&#1086;&#1077; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1084;&#1099;&#1096;&#1080; &#1085;&#1072; &#1085;&#1077;&#1084;, &#1080; &#1086;&#1085;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090;
&#1087;&#1077;&#1088;&#1077;&#1085;&#1077;&#1089;&#1077;&#1085;&#1086; &#1074; &#1087;&#1088;&#1072;&#1074;&#1091;&#1102; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100;. &#1042;&#1099;&#1081;&#1076;&#1080;&#1090;&#1077; &#1080;&#1079; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1072; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1077;&#1084; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; "Ok".
&#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1074;&#1080;&#1076;&#1077;&#1085; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;: 0.666667 &#1074;&#1086;&#1083;&#1100;&#1090;. &#1047;&#1072;&#1084;&#1077;&#1095;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;,
&#1087;&#1086;&#1093;&#1083;&#1086;&#1087;&#1072;&#1081;&#1090;&#1077; &#1089;&#1077;&#1073;&#1103; &#1087;&#1086; &#1087;&#1083;&#1077;&#1095;&#1091;!
<br>
<br>
<a href="#top">&#1085;&#1072;&#1074;&#1077;&#1088;&#1093;</a><br>
</body>
</html>
