<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <meta http-equiv="Content-Type"
 content="text/html; charset=utf-8">
  <meta name="Author" content="Michael Margraf">
  <title>Qucs - Empezando por el principio</title>
</head>
<body>
<a name="top" id="top"></a>
<center>
<h3>- Qucs -<br>
Quite Universal Circuit Simulator<br>
</h3>
<h1>
Empezando por el principio<br>
<br>
</h1>
</center>
Qucs (se pronuncia en ingl&eacute;s: kju:ks) es un simulador de
circuitos con un interfaz gr&aacute;fico para el usuario. Es capaz de
llevar a cabo muchos tipos diferentes de simulaci&oacute;n (p.
ej.&nbsp; con par&aacute;metros de continua). Este documento le
dar&aacute; una breve descripci&oacute;n para saber como usar Qucs.<br>
<br>
La primera vez que arranca Qucs, crea el directorio ".qucs" dentro de
su directorio home. Todos los archivos se graban en este directorio o
en alguno de sus subdirectorios. Despu&eacute;s de que se haya cargado
Qucs, ver&aacute; la ventana principal con un aspecto similar al de la
figura 1. En el lado derecho hay un &aacute;rea de trabajo (6) que
contiene los esquemas, visores de datos, etc.&nbsp; Si usa las
pesta&ntilde;as (5) sobre ese &aacute;rea, puede cambiar con rapidez
entre los documentos que est&eacute;n abiertos. A la izquierda de la
ventana principal de Qucs hay otro &aacute;rea&nbsp; (1), cuyo
contenido depende de la selecci&oacute;n de las pesta&ntilde;as que se
encuentran en su parte superior:
"Proyectos" (2), "Contenido" (3) y "Componentes" (4). Despu&eacute;s de
ejecutar Qucs, la pesta&ntilde;a de "Proyectos"
(2) se activa. Si es la primera vez que arranca este programa, este
&aacute;rea est&aacute; vac&iacute;a porque no tiene ning&uacute;n
proyecto. Pulse el bot&oacute;n "Nuevo" que est&aacute; encima de este
&aacute;rea (1) para que se abra un di&aacute;logo. Escriba el nombre
de su primer proyecto, p. ej. "primerProyecto" y pulse el bot&oacute;n
"Crear". Qucs crea un directorio de proyecto dentro del directorio
~/.qucs, para este ejemplo se llamar&aacute; "primerProyecto_prj"".
Todos los archivos que pertenezcan a este nuevo proyecto se
guardar&aacute;n dentro de este directorio. El proyecto nuevo se abre
inmediatamente (como se puede ver en la barra del t&iacute;tulo de la
ventana) y las pesta&ntilde;as cambian a la posici&oacute;n de
"Contenido" (3), en la que se muestra en contenido del proyecto
abierto. A&uacute;n no tiene ning&uacute;n documento, as&iacute; que
pulse guardar en la barra de herramientas (o use men&uacute; principal:
Archivo -&gt;Guardar) para guardar el documento sin t&iacute;tulo que
ocupa el &aacute;rea de trabajo (6). Se le pedir&aacute; el nombre del
nuevo documento. Escriba "primerEsquema" y pulse el bot&oacute;n
"Guardar".<br>
<br>
<center>
<img src="qucsmain.png"><br>
Figura 1 - Ventana principal de Qucs<br>
<br>
</center>
<br>
Ahora queremos hacer una simulaci&oacute;n simple de corriente
continua, es decir, queremos analizar el circuito de la figura
(1). Active la pesta&ntilde;a "Componentes" ( (4)&nbsp; en la figura
1).&nbsp; Ah&iacute; vera una caja desplegable donde puede escojer un
grupo de componentes, y debajo, los componentes del grupo seleccionado.
Escoja "componentes sueltos" y pulse en el primer s&iacute;mbolo:
"Resistencia". Si mueve el cursor del rat&oacute;n al &aacute;rea de
trabajo (6) llevar&aacute; el dibujo del s&iacute;mbolo de una
resistencia. Al pulsar el bot&oacute;n derecho del rat&oacute;n rota el
s&iacute;mbolo, al pulsar el bot&oacute;n izquierdo coloca el
componente en el esquema. Repita este proceso para todos los compnentes
tal y como muestra la figura 1.&nbsp; Las fuentes de tensi&oacute;n
est&aacute;n el la pesta&ntilde;a de "fuentes", el s&iacute;mbolo de
tierra se puede tomar de "componentes sueltos" o desde la barra de
herramientas, la simulaci&oacute;n que queremos est&aacute; definida en
los bloques grandes de simulaci&oacute;n que est&aacute;n en la
pesta&ntilde;a "simulaciones". Para editar los par&aacute;metros de la
segunda resistencia, haga doble clic sobre ella. Aparece un
di&aacute;logo en el que puede cambiar la resistencia. Escriba "100
Ohm" en el campo de edici&oacute;n que est&aacute; en el lado derecho y
pulse intro. <br>
<br>
Para conectar los componentes, pulse el bot&oacute;n cablear de la
barra de herramientas (o use el men&uacute; principal: Insertar
-&gt;Cable).
Mueva el cursor sobre una conexi&oacute;n abierta (marcada por
peque&ntilde;os c&iacute;rculos rojos). Haciendo clic en ella comienza
el cable. Ahora mu&eacute;vase al punto final y haga clic otra vez. Los
componentes est&aacute;n conectados as&iacute;. SI desea cambiar la
direcci&oacute;n de la esquina del cable, haga clic con el bot&oacute;n
derecho del rat&oacute;n antes de fijar el punto final. Tambi&eacute;n
se puede finalizar un cable sin pulsar en una conexi&oacute;n abierta o
en un cable: Simplemente haga doble clic con el bot&oacute;n izquierdo
del rat&oacute;n.<br>
<br>
Finalmente, debe etiquetar el nodo en el que quiera que Qucs calcule la
tensi&oacute;n. Pulse en el bot&oacute;n etiqueta de la barra de
herramientas (o use el men&uacute;: Insertar -&gt;Etiqueta de Cable).
Ahora haga clic en el cable deseado. Se abrir&aacute; un di&aacute;logo
para que pueda escribir el nombre del nodo. Escriba "divisor" y haga
clic en el bot&oacute;n "Aceptar". Ahora el circuito deber&iacute;a
parecerse al de la Figura 1.<br>
<br>
Para comenzar la simulaci&oacute;n pulse el bot&oacute;n simular de la
barra de herramientas (o use el men&uacute;: Simulaci&oacute;n -&gt;
Simular) Se abrir&aacute; una ventana que muestra el progreso. Cuando
acabe con &eacute;xito la simulaci&oacute;n se abrir&aacute; la
pantalla de datos. Normalmente, esto ocurre tan r&aacute;pido que
s&oacute;lo ver&aacute; un peque&ntilde;o parpadeo. Ahora tiene que
colocar un diagrama para ver los resultados de la simulaci&oacute;n. En
la parte izquierda se habr&aacute; seleccionado autom&aacute;ticamente
la pesta&ntilde;a de "diagramas" en los componentes. Pulse el elemento
"Tabular", mu&eacute;valo al&nbsp; &aacute;rea de trabajo y
col&oacute;quelo pulsando el bot&oacute;n izquierdo del rat&oacute;n.
Debe abrirse un di&aacute;logo en el que puede escojer lo que el nuevo
diagrama va a mostrar. En la zona de la izquierda ver&aacute; el nodo
que ha definido: "divisor". Haga doble clic en &eacute;l y se
transferir&aacute; a la zona de la derecha.&nbsp; Salga del
di&aacute;logo pulsando el bot&oacute;n "Aceptar". Ahora deber&iacute;a
ver el resultado de la simulaci&oacute;n: 0.666667 voltios.
Maravilloso, &iexcl;D&eacute;se una palmadita en la espalda!<br>
<br>
<a href="#top">Volver al principio</a><br>
</body>
</html>
