<html>

<head>
<meta http-equiv=Content-Type content="text/html; charset=utf-8">
<meta name="Author" content="Jens Flucke">
<title>Qucs - Kurze Beschreibung der Funktionen</title>
</head>



<body>
<a name="top" id="top"></a>

<center><h3>
- Qucs -<br>
Ziemlich Universeller Schaltungssimulator<br>
</h3>
<h1>
Kurze Beschreibung der Funktionen<br><br>
</h1></center>

<h3>Generelle Funktionen</h3>
(g&uuml;ltig in allen Betriebszust&auml;nden)<br>
<table border=2>
<tr><td>Mausrad</td>
<td>Bewegt den Mauszeiger vertikal durch den Zeichenbereich. Kann auch zum Bewegen au&szlig;erhalb der gegenw&auml;rtigen Gr&ouml;&szlig;e genutzt werden.</td>
</tr>
<tr><td>Mausrad + Umstelltaste</td>
<td>Bewegt den Mauszeiger horizontal durch den Zeichenbereich. Kann auch zum Bewegen au&szlig;erhalb der gegenw&auml;rtigen Gr&ouml;&szlig;e genutzt werden.</td>
</tr>
<tr><td>Mausrad + Ctrl-Taste</td>
<td>Vergr&ouml;&szlig;ert oder verkleinert den betrachteten Zeichen-Bereich.</td>
</tr>
</table>


<br><br>
<h3><img src="select.png"> "Auswahl"-Modus</h3>
(Men&uuml;eintrag: Bearbeiten->Ausw&auml;hlen (Esc))<br>
<table border=2>
<tr><td>linke Maustaste</td>
<td>W&auml;hlt das Element aus, das sich unter dem Mauszeiger befindet. Wenn sich dort mehrere Komponenten befinden, so kann man einige Mal klicken, bis die gew&uuml;nschte Komponente ausgew&auml;hlt ist.<br>
W&auml;hrend man die Maustaste gedr&uuml;ckt h&auml;lt, kann man die Maus bewegen und somit die selektierte Komponente bewegen. Sind mehrere Komponenten ausgew&auml;hlt, so werden diese alle bewegt.<br>
Wird die Maustaste gedr&uuml;ckt, w&auml;hrend sich unter ihr kein Element befindet, so &ouml;ffnet sich ein Rechteck. Durch das Bewegen der Maus bei gedr&uuml;ckter Maustaste wird ein Rechteck aufgezogen. Nach dem Loslassen der Maustaste sind alle Elemente ausgew&auml;hlt, die sich vollst&auml;ndig innerhalb das Rechtecks befanden.<br>
Ein ausgew&auml;hltes Diagramm oder eine Zeichnung kann vergr&ouml;&szlig;ert oder verkleinert werden, indem man auf eine der Ecken des Diagramms mit dem Mauszeiger klickt und w&auml;hrend dessen die Maus bewegt.<br>
Nach Dr&uuml;cken auf Komponententext kann dieser direkt editiert werden. Mit
der Eingabetaste gelangt man zur nächsten Zeile. Wenn der momentane
Komponententext eine Auswahlliste ist, so kann er nur mit den Cursor
hoch/runter Tasten ver&auml;ndert werden.</td>
</tr>
<tr><td>linke Maustaste + Ctrl-Taste</td>
<td>Erlaubt es, mehr als ein einziges Element auszuw&auml;hlen, z.B. das Ausw&auml;hlen eines Elementes hebt die Auswahl f&uuml;r ein anderes zuvor selektiertes Element nicht auf. Diese Funktion kann ebenfall erreicht werden durch das Aufziehen eines Rechtecks mit der Maus. Dazu wird die linke Maustaste gedr&uuml;ckt und w&auml;hrend dessen die Maus bewegt. Alle <strong>vollst&auml;ndig</strong> in dem Rechteck befindlichen Elemente werden ausgew&auml;hlt (Eintrag "linke Maustaste" vorher beachten).</td>
</tr>
<tr><td>rechte Maustaste</td>
<td>Klick auf einen Draht selektiert einen einzigen geraden Draht anstatt eines kompletten Leitungszuges.</td>
</tr>
<tr><td>doppel-klick rechte Maustaste</td>
<td>&Ouml;ffnet einen Dialog zum Ver&auml;ndern der Elementeigenschaften (Die Beschriftung von Dr&auml;hten, die Parameter von
Komponenten, etc.).</td>
</tr>
</table>


<br><br>
<h3>"Einf&uuml;gen Komponente"-Modus</h3>
(Klick auf eine Komponente/Diagramm in der Hauptarbeitsfl&auml;che)<br>
<table border=2>
<tr><td>linke Maustaste</td>
<td>Plaziert eine neue Instanz einer Komponente in das Hauptarbeitsfenster.</td>
</tr>
<tr><td>rechte Maustaste</td>
<td>Dreht eine Komponente, jeweils um 90°. (Hat keinen Einflu&szlig; auf Diagramme.)</td>
</tr>
</table>


<br><br>
<h3><img src="wire.png"> "Draht"-Modus</h3>
(Men&uuml;eintrag: Einf&uuml;gen->Draht (STRG-E))<br>
<table border=2>
<tr><td>linke Maustaste</td>
<td>Setzt den Start-/Endpunkt eines Drahtes.</td>
</tr>
<tr><td>rechte Maustaste</td>
<td>&Auml;ndert die Richtung einer Drahtecke (zuerst links/recht oder hoch/runter).</td>
</tr>
<tr><td>doppel-klick rechte Maustaste</td>
<td>Beendet einen Draht ohne an einem Draht oder Port zu sein.</td>
</tr>
</table>


<br><br>
<h3><img src="paste.png"> "Einf&uuml;gen"-Modus</h3>
(Men&uuml;eintrag: Bearbeiten->Einf&uuml;gen (STRG-V))<br>
<table border=2>
<tr><td>linke Maustaste</td>
<td>Plaziert eine Komponente in dem Hauptarbeitsfenster (aus der Zwischenablage).</td>
</tr>
<tr><td>rechte Maustaste</td>
<td>Dreht das Element.</td>
</tr>
</table>


<br><br>
<h3>Maus im "Inhalt"-Reiter  <img src="inhalttab.png"></h3><br>
<table border=2>
<tr><td>links Klick</td>
<td>W&auml;hlt eine Datei aus.</td>
</tr>
<tr><td>doppel-Klick</td>
<td>&Ouml;ffnet eine Datei.</td>
</tr>
<tr><td>rechts Klick</td>
<td>Zeigt ein Men&uuml; mit:<br>
    <table>
    <tr><td>"&Ouml;ffnen"  </td> <td> - &Ouml;ffnet die ausgew&auml;hlte Datei</td></tr>
    <tr><td>"Umbenennen"</td> <td> - &Auml;ndert den Namen der ausgew&auml;hlten Datei</td></tr>
    <tr><td>"L&ouml;schen"</td> <td> - L&ouml;scht die ausgew&auml;hlte Datei</td></tr>
    <tr><td>"Gruppe l&ouml;schen"</td> <td> - L&ouml;scht die ausgew&auml;hlte Datei und alle von ihr abgangigen Dateien
     (Schematic, Data-Diagramm, Simulationsdaten)</td></tr>
    </table>
</td></tr>
</table>


<br><br>
<h3>Tastatur</h3>
Viele Aktionen k&ouml;nnen &uuml;ber Tastatureingaben aktivert/ausgef&uuml;hrt werden. 
Die zu den Befehlen geh&ouml;rigen Tastatureingaben kann man immer rechts neben den 
Texten im Men&uuml; finden. Einige weitere Tastaturkommandos sind in der folgenden Liste dargestellt:
<table border=2>
<tr><td>"L&ouml;schen" oder "Wagenr&uuml;cklauf (Backspace)"</td>
<td>L&ouml;scht das gegenw&auml;rtig ausgew&auml;hlte Element oder schaltet den "L&ouml;schen"-Modus ein, wenn kein Element ausgew&auml;hlt wurde.
</td>
</tr>
<tr><td>Cursor links/rechts</td>
<td>
&Auml;ndert die Position des Markers innerhalb eines Graphen.<br>
Wenn kein Marker ausgew&auml;hlt wurde, werden die selektierten Elemente bewegt.<br>
Wenn kein Element ausgew&auml;hlt wurde, bewegt man sich durch das Dokument.
</td>
</tr>
<tr><td>Cursor hoch/runter</td>
<td>
&Auml;ndert die Position des ausgew&auml;hlten Markers in einem mehrdimensionalen Graphen.<br>
Wenn kein Marker ausgew&auml;hlt wurde, werden die selektierten Elemente bewegt.<br>
Wenn kein Element ausgew&auml;hlt wurde, bewegt man sich durch das Dokument.
</td>
</tr>
<tr><td>Tabulator-Taste</td>
<td>Geht zum n&auml;chsten ge&ouml;ffneten Dokument (bezogen auf die oben vorhandenen Tabulator-Reiter).</td>
</tr>
</table>


<br><br><a href="#top">zur&uuml;ck nach oben</a><br>
</body>
</html>
