<html>

<head>
<meta http-equiv=Content-Type content="text/html; charset=utf-8">
<meta name="Author" content="Public domain">
<title>Qucs - Einf&uuml;hrung in die Optimierung</title>
</head>

<body>
<a name="top" id="top"></a>

<center><h3>
- Qucs -<br>
Ziemlich Universeller Schaltungssimulator<br>
</h3>
<h1>
Einf&uuml;hrung in die Optimierung<br>
<br>
</h1></center>

F&uuml;r die Schaltkreisoptimierung verwendet Qucs ein Programm namens ASCO
(<a href="http://asco.sourceforge.net/">http://asco.sourceforge.net/</a>).
Es folgt eine kurze Beschreibung, wie man ein Schaltplan daf&uuml;r
vorbereitet, die Optimierung ausf&uuml;hrt und die Ergebnisse
interpretieren kann.  Bevor man diese Funktionalit&auml;t benutzen kann,
muss ASCO auf Ihrem Computer installiert sein.
<br><br>

Die Optimierung eines Schaltkreises ist nicht mehr als die Minimierung
einer Kostenfunktion.  Das kann entweder die Verz&ouml;gerungszeit oder die
Anstiegszeit in einer digitalen Schaltung, oder die
Leistungsverst&auml;rkung einer analogen Schaltung sein.  Eine andere
M&ouml;glichkeit ist die Definition des Optimierungsproblems als eine
Zusammensetzung von Funktionen, was in diesem Fall zu einem G&uuml;tefaktor
f&uuml;hrt.
<br><br>

Um einen Schaltplan f&uuml;r ein Optimierung vorzubereiten, m&uuml;ssen zwei
Dinge hinzugef&uuml;gt werden: Gleichungen und die Optimierungskomponente.
Nehmen Sie den Schaltplan aus Abbildung 1 und ver&auml;ndern Sie es
solange, bis Sie den Schaltplan in Abbildung 2 erhalten.
<br><br>

<center>
<img src="optimization1.png"><br>Abbildung 1 - Urspr&uuml;nglicher Schaltplan.<br><br>
</center>

<center>
<img src="optimization2.png"><br>Abbildung 2 - Vorbereiteter Schaltplan.<br><br>
</center>

<br>
Jetzt &ouml;ffnen Sie die Optimierungskomponente und w&auml;hlen die
Algorithmusschaltfl&auml;che an.  Aus den existierenden Parametern sollte
besonders auf 'Maximale Anzahl der Iterationen', 'Constant F' und
'Crossing over factor' geachtet werden.  &Uuml;ber- oder Untersch&auml;tzung
kann zur vorzeitigen Konvergenz des Optimierers in einem lokalen
Optimum f&uuml;hren oder auch zu sehr langen Optimierungszeiten.
<br><br>

<center>
<img src="optimization3.png"><br>Abbildung 3 - Optimierungsdialog, Algorithmusoptionen.<br><br>
</center>

<br>
Die Variablenschaltfl&auml;che, wo die Schaltkreiselemente definiert
werden, die in einem bestimmten Interval optimiert werden k&ouml;nnen, ist
in Abbildung 4 dargestellt.  Die Variablennamen korrespondieren zu den
Namen, die in die Komponenteneigenschaften platziert wurden und
<b>nicht</b> zu den Namen der Komponenten.
<br><br>

<center>
<img src="optimization4.png"><br>Abbildung 4 - Optimierungsdialog, Variablenoptionen.<br><br>
</center>

<br>
Schlie&szlig;lich m&uuml;ssen noch die Ziele der Optimierung (maximieren,
minimieren) und Optimierungsgrenzen (kleiner, gr&ouml;&szlig;er, gleich) in der
Zielschaltfl&auml;che eingegeben werden.  ASCO kombiniert diese Ziele zu
einer einzigen Kostenfunktion, die dann minimiert wird.
<br><br>

<center>
<img src="optimization5.png"><br>Abbildung 5 - Optimierungsdialog, Zieloptionen.<br><br>
</center>

<br>
Der n&auml;chste Schritt ist die Ver&auml;nderung des Schaltplans und die
Definition der Schaltkreiselemente, die optimiert werden sollen.  Der
enstehende Schaltplan wird in Abbildung 6 dargestellt.
<br><br>

<center>
<img src="optimization6.png"><br>Abbildung 6 - Neues Qucs Hauptfenster.<br><br>
</center>

<br>
Der letzte Schritt ist die Ausf&uuml;hrung der Optimierung, d.h. das
Starten der Simulation durch Dr&uuml;cken von F2.  Wenn die Optimierung
beendet ist, was auf einem modernen Computer ein paar Sekunden dauert,
werden die besten Simulationsergebnisse angezeigt.
<br><br>

<center>
<img src="optimization7.png"><br>Abbildung 7 - Qucs Ergebnisfenster.<br><br>
</center>

Die besten Schaltkreisgr&ouml;&szlig;en findet man im Optimierungsdialog auf der
Variablenschaltfl&auml;che.  Es sind jetzt die Anfangswerte f&uuml;r jede der
eingef&uuml;hrten Variablen (siehe Abbildung 8).
<br><br>

<center>
<img src="optimization8.png"><br>Abbildung 8 - Die optimierten Schaltkreisgr&ouml;&szlig;en.<br><br>
</center>

<br><br><a href="#top">zur&uuml;ck nach oben</a><br>
</body>
</html>
