<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <meta http-equiv="Content-Type"
 content="text/html; charset=utf-8">
  <meta name="Author" content="Michael Margraf">
  <title>Qucs - Trabajar con Subcircuitos</title>
</head>
<body>
<a name="top" id="top"></a>
<center>
<h3>- Qucs -<br>
Trabajar con Subcircuitos<br>
</h3>
</center>
Los Subcircuitos se usan para dar m&aacute;s claridad a un esquema. Es
muy &uacute;til en circuitos muy grandes o en circuitos en los que
aparece un mismo bloque de componentes varias veces.<br>
En Qucs cada esquema que contenga una conexi&oacute;n de subcircuito es
un subcircuito. Para conseguir una conexi&oacute;n de subcircuitos use
la barra de herramientas, la vista de componentes (en componentes
sueltos) o el&nbsp; men&uacute; (Insertar -&gt; Insertar
conexi&oacute;n).&nbsp;
Despu&eacute;s de colocar todas las conexiones del subcircuito (por
ejemplo, dos) tiene que guardar el esquema (pulse CTRL-S). Si echa un
vistazo a la lista de contenidos (figura 1) ver&aacute; que ahora
aparecer&aacute; un "2-port" a la derecha del nombre del esquema
(columna "Nota"). Esta nota marca todos los documentos que son
subcircuitos. Ahora cmbie a un esquema en el que quiera usar el
subcircuito. Despu&eacute;s pulse en el nombre del subcircuito (vista
de contenido).&nbsp; Volviendo a entrar en el &aacute;rea del documento
ver&aacute; que ahora puede colocar el subcircuito dentro del circuito
principal. H&aacute;galo y complete el esquema. Ahora puede realizar
una simulaci&oacute;n. El resultado es el mismo que si todos los
componentes del subcircuito se hubieran colocado directamente en el
circuito.<br>
<center>
<img src="subcircuit.png"><br>
Figura 1 - Acceder a un subcircuito<br>
<br>
</center>
Si selecciona un componente subcircuito (clic en su s&iacute;mbolo en
el esquema) puede entrar en el esquema del subcircuito pulsando
CTRL-I (por supuesto, esta funci&oacute;n est&aacute; accesible
tambi&eacute;n via barra de herramientas y men&uacute;). Puede salir
del subcircuito pulsando CTRL-H.
<br>
<br>
<br>
Si no le gusta el s&iacute;mbolo dado al componente de un subcircuito,
puede dibujar su propio s&iacute;mbolo. Simplemente haga el esquema del
subcircuito y vaya al men&uacute;: Archivo -&gt;Editar s&iacute;mbolo
de circuito. Si no ha dibujado a&uacute;n un s&iacute;mbolo para este
circuito se crear&aacute; un dibujo simple para este. Ahora puede
editar este s&iacute;mbolo pintando l&iacute;neas y arcos. Cuando
termine gu&aacute;rdelo. Ahora col&oacute;quelo en otro esquema y,
voil&aacute;, tiene un nuevo s&iacute;mbolo. <br>
<br>
<a href="#top">Volver al principio</a><br>
</body>
</html>
