<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <meta http-equiv="Content-Type"
 content="text/html; charset=iso-8859-1">
  <meta name="Author" content="Michael Margraf">
  <title>Qucs - &#1057;&#1086;&#1075;&#1083;&#1072;&#1089;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1089;&#1093;&#1077;&#1084;&#1099;</title>
</head>
<body>
<a name="top" id="top"></a>
<center>
<h3>- Qucs -<br>
</h3>
<h3>&#1055;&#1086;&#1095;&#1090;&#1080; &#1091;&#1085;&#1080;&#1074;&#1077;&#1088;&#1089;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1089;&#1080;&#1084;&#1091;&#1083;&#1103;&#1090;&#1086;&#1088; &#1094;&#1077;&#1087;&#1077;&#1081;</h3>
<h3><br>
</h3>
<h1>&#1057;&#1086;&#1075;&#1083;&#1072;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1094;&#1077;&#1087;&#1077;&#1081;<br>
<br>
</h1>
</center>
&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1089;&#1086;&#1075;&#1083;&#1072;&#1089;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1094;&#1077;&#1087;&#1077;&#1081; &#1095;&#1072;&#1089;&#1090;&#1086; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074; &#1084;&#1080;&#1082;&#1088;&#1086;&#1074;&#1086;&#1083;&#1085;&#1086;&#1074;&#1086;&#1081;
&#1090;&#1077;&#1093;&#1085;&#1086;&#1083;&#1086;&#1075;&#1080;&#1080;. Qucs &#1084;&#1086;&#1078;&#1077;&#1090; &#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1101;&#1090;&#1086; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;. &#1053;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1077; &#1096;&#1072;&#1075;&#1080; &#1076;&#1083;&#1103;
&#1101;&#1090;&#1086;&#1075;&#1086;:<br>
<lu>
<li>&#1042;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1100; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; S-&#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1088;&#1072;&#1089;&#1089;&#1095;&#1080;&#1090;&#1072;&#1090;&#1100; &#1082;&#1086;&#1101;&#1092;&#1092;&#1080;&#1094;&#1080;&#1077;&#1085;&#1090;
&#1086;&#1090;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;.</li>
<li>&#1042;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1076;&#1080;&#1072;&#1075;&#1088;&#1072;&#1084;&#1084;&#1091;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1082;&#1086;&#1101;&#1092;&#1092;&#1080;&#1094;&#1080;&#1077;&#1085;&#1090; &#1086;&#1090;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; (&#1090;&#1086; &#1077;&#1089;&#1090;&#1100;,
S[1,1] &#1076;&#1083;&#1103; &#1087;&#1086;&#1088;&#1090;&#1072; 1, S[2,2] &#1076;&#1083;&#1103; &#1087;&#1086;&#1088;&#1090;&#1072; 2 &#1080; &#1090;.&#1076;.)</li>
<li>&#1055;&#1086;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1085;&#1072; &#1075;&#1088;&#1072;&#1092;&#1080;&#1082; &#1084;&#1072;&#1088;&#1082;&#1077;&#1088; &#1080; &#1076;&#1074;&#1080;&#1075;&#1072;&#1090;&#1100;&#1089;&#1103; &#1096;&#1072;&#1075;&#1072;&#1084;&#1080; &#1082; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1084;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1086;&#1090;&#1077;.</li>
<li>&#1053;&#1072;&#1078;&#1072;&#1090;&#1100; &#1087;&#1088;&#1072;&#1074;&#1091;&#1102; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1084;&#1099;&#1096;&#1080; &#1085;&#1072; &#1084;&#1072;&#1088;&#1082;&#1077;&#1088;&#1077; &#1080; &#1074;&#1099;&#1073;&#1088;&#1072;&#1090;&#1100; "&#1089;&#1086;&#1075;&#1083;&#1072;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;
&#1084;&#1086;&#1097;&#1085;&#1086;&#1089;&#1090;&#1080;" &#1074; &#1087;&#1086;&#1103;&#1074;&#1080;&#1074;&#1096;&#1077;&#1084;&#1089;&#1103; &#1084;&#1077;&#1085;&#1102;.</li>
<li>&#1055;&#1086;&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1084;&#1086;&#1078;&#1085;&#1086; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;,
&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1086;&#1087;&#1086;&#1088;&#1085;&#1086;&#1077; &#1087;&#1086;&#1083;&#1085;&#1086;&#1077; &#1089;&#1086;&#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1086; &#1086;&#1090;&#1083;&#1080;&#1095;&#1072;&#1102;&#1097;&#1080;&#1084;&#1089;&#1103;
&#1086;&#1090; 50 &#1054;&#1084;.</li>
<li>&#1055;&#1086;&#1089;&#1083;&#1077; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1103; &#1085;&#1072; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; "&#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100;" &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1090; &#1082; &#1089;&#1093;&#1077;&#1084;&#1077;, &#1080; &#1089;
&#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1091;&#1088;&#1089;&#1086;&#1088;&#1072; &#1084;&#1099;&#1096;&#1080; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1086; &#1084;&#1077;&#1089;&#1090;&#1086; &#1076;&#1083;&#1103; &#1074;&#1089;&#1090;&#1072;&#1074;&#1082;&#1080; &#1089;&#1086;&#1075;&#1083;&#1072;&#1089;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1081;
&#1094;&#1077;&#1087;&#1080;.</li>
</lu>
<br>
&#1051;&#1077;&#1074;&#1072;&#1103; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1072; &#1089;&#1086;&#1075;&#1083;&#1072;&#1089;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1081; &#1094;&#1077;&#1087;&#1080; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074;&#1093;&#1086;&#1076;&#1086;&#1084;, &#1072; &#1087;&#1088;&#1072;&#1074;&#1072;&#1103; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1072;
&#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1073;&#1099;&#1090;&#1100; &#1087;&#1086;&#1076;&#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1072; &#1082; &#1089;&#1093;&#1077;&#1084;&#1077;.
<br>
&#1045;&#1089;&#1083;&#1080; &#1084;&#1072;&#1088;&#1082;&#1077;&#1088; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1085;&#1072; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1091;&#1102; &#1087;&#1086;&#1076; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; "Sopt", &#1074; &#1084;&#1077;&#1085;&#1102;
&#1087;&#1086;&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1086;&#1087;&#1094;&#1080;&#1103; "&#1089;&#1086;&#1075;&#1083;&#1072;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1096;&#1091;&#1084;&#1072;". &#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1095;&#1090;&#1086;
&#1077;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1084; &#1086;&#1090;&#1083;&#1080;&#1095;&#1080;&#1077;&#1084; &#1086;&#1090; "&#1089;&#1086;&#1075;&#1083;&#1072;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1084;&#1086;&#1097;&#1085;&#1086;&#1089;&#1090;&#1080;" &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1090;&#1086;, &#1095;&#1090;&#1086;
&#1073;&#1077;&#1088;&#1077;&#1090;&#1089;&#1103; &#1089;&#1086;&#1087;&#1088;&#1103;&#1078;&#1077;&#1085;&#1085;&#1099;&#1081; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1089;&#1085;&#1099;&#1081; &#1082;&#1086;&#1101;&#1092;&#1092;&#1080;&#1094;&#1080;&#1077;&#1085;&#1090; &#1086;&#1090;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;.
&#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091;, &#1077;&#1089;&#1083;&#1080; &#1091; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1081; &#1076;&#1088;&#1091;&#1075;&#1086;&#1077; &#1080;&#1084;&#1103;, &#1089;&#1086;&#1075;&#1083;&#1072;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1096;&#1091;&#1084;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100;
&#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1086; &#1087;&#1091;&#1090;&#1077;&#1084; &#1087;&#1077;&#1088;&#1077;&#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1081; &#1074; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1084; &#1086;&#1082;&#1085;&#1077;.
<br>
&#1044;&#1080;&#1072;&#1083;&#1086;&#1075; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1089;&#1086;&#1075;&#1083;&#1072;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1090;&#1072;&#1082;&#1078;&#1077; &#1074;&#1099;&#1079;&#1074;&#1072;&#1085; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1077;&#1085;&#1102;
(&#1048;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;-&gt;&#1089;&#1086;&#1075;&#1083;&#1072;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1094;&#1077;&#1087;&#1080;)
&#1080;&#1083;&#1080; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1080; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096; (&lt;CTRL-5&gt;). &#1053;&#1086; &#1090;&#1086;&#1075;&#1076;&#1072; &#1074;&#1089;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;
&#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1074;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100;&#1089;&#1103; &#1074;&#1088;&#1091;&#1095;&#1085;&#1091;&#1102;.
<br>
<br>
<h3>&#1057;&#1086;&#1075;&#1083;&#1072;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1095;&#1077;&#1090;&#1099;&#1088;&#1077;&#1093;&#1087;&#1086;&#1083;&#1102;&#1089;&#1085;&#1080;&#1082;&#1072;<br>
</h3>
&#1045;&#1089;&#1083;&#1080; &#1080;&#1084;&#1103; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1081; &#1074; &#1090;&#1077;&#1082;&#1089;&#1090;&#1077; &#1084;&#1072;&#1088;&#1082;&#1077;&#1088;&#1072; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; S-&#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1084;, &#1090;&#1086;
&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1086;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1089;&#1086;&#1075;&#1083;&#1072;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074;&#1093;&#1086;&#1076;&#1072; &#1080; &#1074;&#1099;&#1093;&#1086;&#1076;&#1072;
&#1095;&#1077;&#1090;&#1099;&#1088;&#1077;&#1093;&#1087;&#1086;&#1083;&#1102;&#1089;&#1085;&#1086;&#1081; &#1094;&#1077;&#1087;&#1080;.
&#1069;&#1090;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1086;&#1095;&#1077;&#1085;&#1100; &#1087;&#1086;&#1093;&#1086;&#1078;&#1077; &#1085;&#1072; &#1074;&#1099;&#1096;&#1077;&#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1099;&#1077; &#1096;&#1072;&#1075;&#1080;. &#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1086;&#1084; &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103;
&#1076;&#1074;&#1077; &#1089;&#1086;&#1075;&#1083;&#1072;&#1089;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1094;&#1077;&#1087;&#1080;: &#1089;&#1072;&#1084;&#1099;&#1081; &#1083;&#1077;&#1074;&#1099;&#1081; &#1091;&#1079;&#1077;&#1083; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1103;&#1090;&#1100;&#1089;&#1103; &#1089; &#1087;&#1086;&#1088;&#1090;&#1086;&#1084; 1,
&#1089;&#1072;&#1084;&#1099;&#1081; &#1087;&#1088;&#1072;&#1074;&#1099;&#1081; &#1091;&#1079;&#1077;&#1083; - &#1089; &#1087;&#1086;&#1088;&#1090;&#1086;&#1084; 2, &#1072; &#1076;&#1074;&#1072; &#1091;&#1079;&#1083;&#1072; &#1074; &#1089;&#1077;&#1088;&#1077;&#1076;&#1080;&#1085;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099;
&#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1103;&#1090;&#1100;&#1089;&#1103; &#1089; &#1095;&#1077;&#1090;&#1099;&#1088;&#1077;&#1093;&#1087;&#1086;&#1083;&#1102;&#1089;&#1085;&#1080;&#1082;&#1086;&#1084;.
<br>
<br>
<br>
<a href="#top">&#1085;&#1072;&#1074;&#1077;&#1088;&#1093;</a>
</body>
</html>
