<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <meta http-equiv="Content-Type"
 content="text/html; charset=iso-8859-1">
  <meta name="Author" content="Michael Margraf">
  <title>Qucs - &#1055;&#1077;&#1088;&#1074;&#1099;&#1077; &#1096;&#1072;&#1075;&#1080; &#1074; &#1094;&#1080;&#1092;&#1088;&#1086;&#1074;&#1086;&#1084; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080;</title>
</head>
<body>
<a name="top" id="top"></a>
<center>
<h3>- Qucs -<br>
&#1055;&#1086;&#1095;&#1090;&#1080; &#1091;&#1085;&#1080;&#1074;&#1077;&#1088;&#1089;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1089;&#1080;&#1084;&#1091;&#1083;&#1103;&#1090;&#1086;&#1088; &#1094;&#1077;&#1087;&#1077;&#1081;<br>
</h3>
<h1>&#1055;&#1077;&#1088;&#1074;&#1099;&#1077; &#1096;&#1072;&#1075;&#1080; &#1074;<br>
&#1094;&#1080;&#1092;&#1088;&#1086;&#1074;&#1086;&#1084; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080;<br>
<br>
</h1>
</center>
Qucs - &#1101;&#1090;&#1086; &#1090;&#1072;&#1082;&#1078;&#1077; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103; &#1076;&#1083;&#1103; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103;
&#1094;&#1080;&#1092;&#1088;&#1086;&#1074;&#1086;&#1075;&#1086; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;.
&#1069;&#1090;&#1086;&#1090; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&nbsp; &#1074;&#1082;&#1088;&#1072;&#1090;&#1094;&#1077; &#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090;, &#1082;&#1072;&#1082; &#1076;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; Qucs.
<br>
<br>
&#1044;&#1083;&#1103; &#1094;&#1080;&#1092;&#1088;&#1086;&#1074;&#1086;&#1075;&#1086; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; Qucs &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1091; FreeHDL (<a
 href="http://www.freehdl.seul.org">http://www.freehdl.seul.org</a>).
&#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1087;&#1072;&#1082;&#1077;&#1090;&nbsp; FreeHDL, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1082;&#1086;&#1084;&#1087;&#1080;&#1083;&#1103;&#1090;&#1086;&#1088; GNU C++ &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100;
&#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1099; &#1074; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1077;.<br>
<br>
&#1053;&#1077;&#1090; &#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1081; &#1088;&#1072;&#1079;&#1085;&#1080;&#1094;&#1099; &#1074; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1080; &#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1075;&#1086; &#1080;&#1083;&#1080; &#1094;&#1080;&#1092;&#1088;&#1086;&#1074;&#1086;&#1075;&#1086;
&#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;. &#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1087;&#1086;&#1089;&#1083;&#1077; &#1087;&#1088;&#1086;&#1095;&#1090;&#1077;&#1085;&#1080;&#1103; <a href="start.html">&#1055;&#1077;&#1088;&#1074;&#1099;&#1077;
&#1096;&#1072;&#1075;&#1080; &#1074;&nbsp; &#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1084; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080;</a> &#1083;&#1077;&#1075;&#1082;&#1086; &#1076;&#1086;&#1073;&#1080;&#1090;&#1100;&#1089;&#1103;, &#1095;&#1090;&#1086;&#1073;&#1099;
&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1083;&#1086; &#1094;&#1080;&#1092;&#1088;&#1086;&#1074;&#1086;&#1077; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;.
&#1044;&#1072;&#1074;&#1072;&#1081;&#1090;&#1077; &#1088;&#1072;&#1089;&#1089;&#1095;&#1080;&#1090;&#1072;&#1077;&#1084; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1091; &#1080;&#1089;&#1090;&#1080;&#1085;&#1085;&#1086;&#1089;&#1090;&#1080; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1075;&#1086; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072; &#1048;.
&#1042;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1094;&#1080;&#1092;&#1088;&#1086;&#1074;&#1099;&#1077; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099; &#1074; &#1074;&#1099;&#1087;&#1072;&#1076;&#1072;&#1102;&#1097;&#1077;&#1084; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1080; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074;
&#1089;&#1083;&#1077;&#1074;&#1072; &#1080; &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1081;&#1090;&#1077; &#1089;&#1093;&#1077;&#1084;&#1091;, &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1085;&#1091;&#1102; &#1085;&#1072; &#1088;&#1080;&#1089;. 1. &#1041;&#1083;&#1086;&#1082; &#1094;&#1080;&#1092;&#1088;&#1086;&#1074;&#1086;&#1075;&#1086;
&#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1084;&#1086;&#1078;&#1085;&#1086; &#1085;&#1072;&#1081;&#1090;&#1080; &#1089;&#1088;&#1077;&#1076;&#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1073;&#1083;&#1086;&#1082;&#1086;&#1074; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;.<br>
&#1062;&#1080;&#1092;&#1088;&#1086;&#1074;&#1099;&#1077; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1080; <i>S1</i> &#1080; <i>S2</i> &#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1099; &#1082;&#1086; &#1074;&#1093;&#1086;&#1076;&#1072;&#1084;, &#1091;&#1079;&#1077;&#1083; &#1089;
&#1084;&#1077;&#1090;&#1082;&#1086;&#1081; <i>Output</i> &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074;&#1099;&#1093;&#1086;&#1076;&#1086;&#1084;. &#1055;&#1086;&#1089;&#1083;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;
&#1086;&#1090;&#1082;&#1088;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1055;&#1086;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1077; &#1085;&#1072; &#1085;&#1077;&#1077; &#1076;&#1080;&#1072;&#1075;&#1088;&#1072;&#1084;&#1084;&#1091; "&#1058;&#1072;&#1073;&#1083;&#1080;&#1094;&#1072;
&#1080;&#1089;&#1090;&#1080;&#1085;&#1085;&#1086;&#1089;&#1090;&#1080;" &#1080; &#1074;&#1089;&#1090;&#1072;&#1074;&#1100;&#1090;&#1077; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1091;&#1102; <i>Output</i>. &#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;
&#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1072; &#1080;&#1089;&#1090;&#1080;&#1085;&#1085;&#1086;&#1089;&#1090;&#1080; &#1076;&#1074;&#1091;&#1093;-&#1074;&#1093;&#1086;&#1076;&#1086;&#1074;&#1086;&#1075;&#1086; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072; &#1048;. &#1055;&#1086;&#1079;&#1076;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;, &#1087;&#1077;&#1088;&#1074;&#1086;&#1077;
&#1094;&#1080;&#1092;&#1088;&#1086;&#1074;&#1086;&#1077; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1089;&#1076;&#1077;&#1083;&#1072;&#1085;&#1086;!
<br>
<br>
<center>
<img src="qucsdigi.png"><br>
&#1056;&#1080;&#1089;. 1 - &#1043;&#1083;&#1072;&#1074;&#1085;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086; Qucs<br>
<br>
</center>
<br>
&#1058;&#1072;&#1073;&#1083;&#1080;&#1094;&#1072; &#1080;&#1089;&#1090;&#1080;&#1085;&#1085;&#1086;&#1089;&#1090;&#1080; - &#1085;&#1077; &#1077;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1081; &#1074;&#1080;&#1076; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1084;&#1086;&#1078;&#1077;&#1090;
&#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1100; Qucs.
&#1042;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1090;&#1072;&#1082;&#1078;&#1077; &#1087;&#1086;&#1076;&#1072;&#1090;&#1100; &#1074; &#1089;&#1093;&#1077;&#1084;&#1091; &#1089;&#1083;&#1091;&#1095;&#1072;&#1081;&#1085;&#1099;&#1081; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083; &#1080; &#1087;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100; &#1074;&#1099;&#1093;&#1086;&#1076;&#1085;&#1086;&#1081;
&#1089;&#1080;&#1075;&#1085;&#1072;&#1083; &#1074;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1081; &#1076;&#1080;&#1072;&#1075;&#1088;&#1072;&#1084;&#1084;&#1077;. &#1063;&#1090;&#1086;&#1073;&#1099; &#1101;&#1090;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100;, &#1085;&#1091;&#1078;&#1085;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100;
&#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <i>Type</i>
&#1073;&#1083;&#1086;&#1082;&#1072; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1085;&#1072; <i>TimeList</i> &#1080; &#1074; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1085;&#1091;&#1078;&#1085;&#1086;
&#1074;&#1074;&#1077;&#1089;&#1090;&#1080; &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;.
&#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1091; &#1094;&#1080;&#1092;&#1088;&#1086;&#1074;&#1099;&#1093; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1086;&#1074; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1089;&#1084;&#1099;&#1089;&#1083;: &#1086;&#1085;&#1080; &#1084;&#1086;&#1075;&#1091;&#1090; &#1074;&#1099;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1089;&#1083;&#1091;&#1095;&#1072;&#1081;&#1085;&#1091;&#1102;
&#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1073;&#1080;&#1090;&#1086;&#1074;, &#1076;&#1083;&#1103; &#1095;&#1077;&#1075;&#1086; &#1080;&#1084; &#1085;&#1091;&#1078;&#1085;&#1086; &#1079;&#1072;&#1076;&#1072;&#1090;&#1100; &#1087;&#1077;&#1088;&#1074;&#1099;&#1081; &#1073;&#1080;&#1090; (&#1085;&#1080;&#1079;&#1082;&#1080;&#1081;
&#1080;&#1083;&#1080; &#1074;&#1099;&#1089;&#1086;&#1082;&#1080;&#1081;) &#1080; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1081; &#1089;&#1084;&#1077;&#1085;&#1099; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103;.
&#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1095;&#1090;&#1086; &#1101;&#1090;&#1086;&#1090; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086;&#1089;&#1083;&#1077; &#1082;&#1086;&#1085;&#1094;&#1072;. &#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091;,
&#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1090;&#1072;&#1082;&#1090;&#1086;&#1074;&#1099;&#1077; &#1080;&#1084;&#1087;&#1091;&#1083;&#1100;&#1089;&#1099; &#1089; &#1095;&#1072;&#1089;&#1090;&#1086;&#1090;&#1086;&#1081; 1 &#1043;&#1043;&#1094; &#1080; &#1089;&#1082;&#1074;&#1072;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; 1:1, &#1074;
&#1101;&#1090;&#1086;&#1084; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1073;&#1099;&#1090;&#1100; &#1079;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1086;: 0.5ns; 0.5ns.<br>
&#1044;&#1083;&#1103; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1086;&#1074; &#1101;&#1090;&#1086;&#1075;&#1086; &#1090;&#1080;&#1087;&#1072; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1077;&#1089;&#1090;&#1100; "&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1040;&#1103;
&#1076;&#1080;&#1072;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072;". &#1042; &#1085;&#1077;&#1081; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1099; &#1074;&#1089;&#1077;&#1093; &#1074;&#1099;&#1093;&#1086;&#1076;&#1085;&#1099;&#1093; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1086;&#1074; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100;
&#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1099; &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1095;&#1085;&#1086; &#1074; &#1086;&#1076;&#1085;&#1086;&#1081; &#1076;&#1080;&#1072;&#1075;&#1088;&#1072;&#1084;&#1084;&#1077;. &#1058;&#1072;&#1082; &#1095;&#1090;&#1086; &#1091;&#1089;&#1087;&#1077;&#1093;&#1086;&#1074; &#1074; &#1101;&#1090;&#1086;&#1084; &#1076;&#1077;&#1083;&#1077;...
<br>
<br>
<h3>&#1060;&#1072;&#1081;&#1083;&#1086;&#1074;&#1099;&#1081; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; VHDL</h3>
&#1041;&#1086;&#1083;&#1077;&#1077; &#1089;&#1083;&#1086;&#1078;&#1085;&#1099;&#1077; &#1080; &#1073;&#1086;&#1083;&#1077;&#1077; &#1091;&#1085;&#1080;&#1074;&#1077;&#1088;&#1089;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1074;&#1080;&#1076;&#1099; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100;
&#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1099; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072; "&#1092;&#1072;&#1081;&#1083; VHDL". &#1069;&#1090;&#1086;&#1090; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100;
&#1074;&#1079;&#1103;&#1090; &#1080;&#1079; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074; (&#1088;&#1072;&#1079;&#1076;&#1077;&#1083; "&#1094;&#1080;&#1092;&#1088;&#1086;&#1074;&#1099;&#1077; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099;"). &#1058;&#1077;&#1084; &#1085;&#1077;
&#1084;&#1077;&#1085;&#1077;&#1077;, &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1091;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;: &#1092;&#1072;&#1081;&#1083; VHDL &#1076;&#1086;&#1083;&#1078;&#1077;&#1085;
&#1073;&#1099;&#1090;&#1100; &#1074; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1077; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;.
&#1047;&#1072;&#1090;&#1077;&#1084; &#1087;&#1077;&#1088;&#1077;&#1081;&#1076;&#1080;&#1090;&#1077; &#1074; &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1080; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1085;&#1072; &#1080;&#1084;&#1103; &#1092;&#1072;&#1081;&#1083;&#1072;.
&#1042;&#1086;&#1081;&#1076;&#1103; &#1074; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1080;&#1103; &#1089;&#1093;&#1077;&#1084;, &#1087;&#1086;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1077; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; VHDL.<br>
&#1055;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1085;&#1099;&#1081; &#1073;&#1083;&#1086;&#1082; &#1074; &#1092;&#1072;&#1081;&#1083;&#1077; VHDL &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;, &#1090;&#1086; &#1077;&#1089;&#1090;&#1100;
&#1079;&#1076;&#1077;&#1089;&#1100; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1099; &#1074;&#1089;&#1077; &#1074;&#1093;&#1086;&#1076;&#1085;&#1099;&#1077; &#1080; &#1074;&#1099;&#1093;&#1086;&#1076;&#1085;&#1099;&#1077; &#1074;&#1099;&#1074;&#1086;&#1076;&#1099;. &#1069;&#1090;&#1080; &#1074;&#1099;&#1074;&#1086;&#1076;&#1099;
&#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1090;&#1072;&#1082;&#1078;&#1077; &#1085;&#1072; &#1089;&#1093;&#1077;&#1084;&#1085;&#1086;&#1084; &#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1080; &#1080; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1099; &#1089;
&#1086;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1089;&#1093;&#1077;&#1084;&#1086;&#1081;.
&#1042;&#1086; &#1074;&#1088;&#1077;&#1084;&#1103; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076; &#1092;&#1072;&#1081;&#1083;&#1072; VHDL &#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074;&nbsp;
VHDL-&#1092;&#1072;&#1081;&#1083; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1075;&#1086; &#1091;&#1088;&#1086;&#1074;&#1085;&#1103;. &#1069;&#1090;&#1086; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1091;&#1095;&#1080;&#1090;&#1099;&#1074;&#1072;&#1090;&#1100;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1101;&#1090;&#1086;
&#1087;&#1088;&#1080;&#1074;&#1086;&#1076;&#1080;&#1090; &#1082; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103;&#1084;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1080;&#1084;&#1077;&#1085;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1074;
VHDL-&#1092;&#1072;&#1081;&#1083;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1086;&#1090;&#1083;&#1080;&#1095;&#1072;&#1090;&#1100;&#1089;&#1103; &#1086;&#1090; &#1080;&#1084;&#1077;&#1085;, &#1091;&#1078;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1087;&#1086;&#1076;&#1089;&#1093;&#1077;&#1084;&#1072;&#1084;. (&#1055;&#1086;&#1089;&#1083;&#1077;
&#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076; &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1074;&#1080;&#1076;&#1077;&#1090;&#1100;, &#1085;&#1072;&#1078;&#1072;&#1074; F6. &#1055;&#1086;&#1083;&#1100;&#1079;&#1091;&#1081;&#1090;&#1077;&#1089;&#1100;
&#1101;&#1090;&#1080;&#1084;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1088;&#1086;&#1095;&#1091;&#1074;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1091;.)
<br>
<br>
<a href="#top">&#1085;&#1072;&#1074;&#1077;&#1088;&#1093;</a><br>
</body>
</html>
