<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
  <meta http-equiv="Content-Type"
 content="text/html; charset=iso-8859-1">
  <meta name="Author" content="Michael Margraf">
  <title>Qucs - &#1056;&#1072;&#1073;&#1086;&#1090;&#1072; &#1089; &#1087;&#1086;&#1076;&#1089;&#1093;&#1077;&#1084;&#1072;&#1084;&#1080;</title>
</head>
<body>
<a name="top" id="top"></a>
<center>
<h3>- Qucs -<br>
&#1056;&#1072;&#1073;&#1086;&#1090;&#1072; &#1089; &#1087;&#1086;&#1076;&#1089;&#1093;&#1077;&#1084;&#1072;&#1084;&#1080;<br>
</h3>
</center>
&#1055;&#1086;&#1076;&#1089;&#1093;&#1077;&#1084;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1074;&#1085;&#1077;&#1089;&#1090;&#1080; &#1073;&#1086;&#1083;&#1100;&#1096;&#1091;&#1102; &#1103;&#1089;&#1085;&#1086;&#1089;&#1090;&#1100; &#1074; &#1089;&#1093;&#1077;&#1084;&#1091;. &#1069;&#1090;&#1086; &#1086;&#1095;&#1077;&#1085;&#1100;
&#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1086; &#1074; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1093; &#1089;&#1093;&#1077;&#1084;&#1072;&#1093; &#1080;&#1083;&#1080; &#1074; &#1089;&#1093;&#1077;&#1084;&#1072;&#1093;, &#1074;&nbsp; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1082;&#1072;&#1082;&#1086;&#1081;-&#1083;&#1080;&#1073;&#1086; &#1073;&#1083;&#1086;&#1082;
&#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074; &#1087;&#1086;&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1088;&#1072;&#1079;.<br>
&#1042; Qucs &#1082;&#1072;&#1078;&#1076;&#1072;&#1103; &#1089;&#1093;&#1077;&#1084;&#1072;, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1072;&#1103; &#1074;&#1099;&#1074;&#1086;&#1076; &#1087;&#1086;&#1076;&#1089;&#1093;&#1077;&#1084;&#1099;, &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086;&#1076;&#1089;&#1093;&#1077;&#1084;&#1086;&#1081;.
&#1042;&#1099;&#1074;&#1086;&#1076; &#1087;&#1086;&#1076;&#1089;&#1093;&#1077;&#1084;&#1099; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1089;&#1087;&#1080;&#1089;&#1082;&#1072;
&#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074; (&#1074; &#1076;&#1080;&#1089;&#1082;&#1088;&#1077;&#1090;&#1085;&#1099;&#1093; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072;&#1093;) &#1080;&#1083;&#1080; &#1084;&#1077;&#1085;&#1102; (&#1042;&#1089;&#1090;&#1072;&#1074;&#1082;&#1072;-&gt;&#1042;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100;
&#1074;&#1099;&#1074;&#1086;&#1076;).
&#1055;&#1086;&#1089;&#1083;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1082;&#1072;&#1082; &#1074;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1099; &#1074;&#1089;&#1077; &#1074;&#1099;&#1074;&#1086;&#1076;&#1099; &#1087;&#1086;&#1076;&#1089;&#1093;&#1077;&#1084;&#1099; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1076;&#1074;&#1072;), &#1085;&#1091;&#1078;&#1085;&#1086;
&#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1087;&#1086;&#1076;&#1089;&#1093;&#1077;&#1084;&#1091; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1085;&#1072;&#1078;&#1072;&#1074; CTRL-S). &#1045;&#1089;&#1083;&#1080; &#1087;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100; &#1074; &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;
&#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; (&#1088;&#1080;&#1089;. 1), &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1074;&#1080;&#1076;&#1077;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1089;&#1087;&#1088;&#1072;&#1074;&#1072; &#1086;&#1090; &#1080;&#1084;&#1077;&#1085;&#1080;
&#1089;&#1093;&#1077;&#1084;&#1099; &#1089;&#1090;&#1086;&#1080;&#1090; "2-&#1087;&#1086;&#1088;&#1090;&#1086;&#1074;&#1099;&#1081;" (&#1089;&#1090;&#1086;&#1083;&#1073;&#1077;&#1094; "&#1055;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077;"). &#1069;&#1090;&#1072; &#1087;&#1086;&#1084;&#1077;&#1090;&#1082;&#1072; &#1077;&#1089;&#1090;&#1100; &#1091;
&#1074;&#1089;&#1077;&#1093; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1087;&#1086;&#1076;&#1089;&#1093;&#1077;&#1084;&#1072;&#1084;&#1080;. &#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1087;&#1077;&#1088;&#1077;&#1081;&#1076;&#1080;&#1090;&#1077; &#1074;
&#1089;&#1093;&#1077;&#1084;&#1091;, &#1075;&#1076;&#1077; &#1042;&#1099; &#1093;&#1086;&#1090;&#1080;&#1090;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1101;&#1090;&#1091; &#1087;&#1086;&#1076;&#1089;&#1093;&#1077;&#1084;&#1091;. &#1047;&#1072;&#1090;&#1077;&#1084; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1085;&#1072; &#1080;&#1084;&#1103;
&#1087;&#1086;&#1076;&#1089;&#1093;&#1077;&#1084;&#1099; (&#1074; &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1075;&#1086;). &#1057;&#1085;&#1086;&#1074;&#1072; &#1074;&#1086;&#1081;&#1076;&#1103; &#1074; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;,
&#1042;&#1099;
&#1074;&#1080;&#1076;&#1080;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1086;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1087;&#1086;&#1076;&#1089;&#1093;&#1077;&#1084;&#1091; &#1074; &#1075;&#1083;&#1072;&#1074;&#1085;&#1091;&#1102; &#1089;&#1093;&#1077;&#1084;&#1091;. &#1057;&#1076;&#1077;&#1083;&#1072;&#1081;&#1090;&#1077;
&#1090;&#1072;&#1082; &#1080; &#1079;&#1072;&#1082;&#1086;&#1085;&#1095;&#1080;&#1090;&#1077; &#1089;&#1093;&#1077;&#1084;&#1091;. &#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1100; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;. &#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;
&#1073;&#1091;&#1076;&#1077;&#1090; &#1090;&#1072;&#1082;&#1086;&#1081; &#1078;&#1077;, &#1082;&#1072;&#1082; &#1077;&#1089;&#1083;&#1080; &#1073;&#1099; &#1074;&#1089;&#1077; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099; &#1087;&#1086;&#1076;&#1089;&#1093;&#1077;&#1084;&#1099; &#1073;&#1099;&#1083;&#1080; &#1087;&#1086;&#1084;&#1077;&#1097;&#1077;&#1085;&#1099;
&#1085;&#1077;&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1085;&#1072; &#1089;&#1093;&#1077;&#1084;&#1091;.<br>
<center>
<img src="subcircuit.png"><br>
&#1056;&#1080;&#1089;. 1 - &#1055;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1077; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; &#1082; &#1087;&#1086;&#1076;&#1089;&#1093;&#1077;&#1084;&#1077;<br>
<br>
</center>
&#1045;&#1089;&#1083;&#1080; &#1074;&#1099;&#1073;&#1088;&#1072;&#1090;&#1100; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;-&#1087;&#1086;&#1076;&#1089;&#1093;&#1077;&#1084;&#1091; (&#1085;&#1072;&#1078;&#1072;&#1074; &#1085;&#1072; &#1077;&#1077; &#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1074; &#1089;&#1093;&#1077;&#1084;&#1077;), &#1090;&#1086;
&#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1086;&#1081;&#1090;&#1080; &#1074; &#1087;&#1086;&#1076;&#1089;&#1093;&#1077;&#1084;&#1091;, &#1085;&#1072;&#1078;&#1072;&#1074; CTRL-I (&#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;, &#1101;&#1090;&#1072; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1072;
&#1095;&#1077;&#1088;&#1077;&#1079; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1080; &#1095;&#1077;&#1088;&#1077;&#1079; &#1084;&#1077;&#1085;&#1102;). &#1052;&#1086;&#1078;&#1085;&#1086; &#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1100;&#1089;&#1103;, &#1085;&#1072;&#1078;&#1072;&#1074; CTRL-H.
<br>
<br>
<br>
&#1045;&#1089;&#1083;&#1080; &#1042;&#1072;&#1084; &#1085;&#1077; &#1085;&#1088;&#1072;&#1074;&#1080;&#1090;&#1089;&#1103; &#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072; &#1087;&#1086;&#1076;&#1089;&#1093;&#1077;&#1084;&#1099;, &#1090;&#1086; &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077;
&#1085;&#1072;&#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1074;&#1086;&#1077; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1077; &#1080; &#1087;&#1086;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1090;&#1077;&#1082;&#1089;&#1090; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072; &#1090;&#1091;&#1076;&#1072;, &#1075;&#1076;&#1077; &#1042;&#1072;&#1084;
&#1085;&#1088;&#1072;&#1074;&#1080;&#1090;&#1089;&#1103;. &#1055;&#1088;&#1086;&#1089;&#1090;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1081;&#1090;&#1077; &#1089;&#1093;&#1077;&#1084;&#1091; &#1087;&#1086;&#1076;&#1089;&#1093;&#1077;&#1084;&#1099; &#1090;&#1077;&#1082;&#1091;&#1097;&#1080;&#1084; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1084; &#1080; &#1087;&#1077;&#1088;&#1077;&#1081;&#1076;&#1080;&#1090;&#1077;
&#1082; &#1084;&#1077;&#1085;&#1102;: &#1060;&#1072;&#1081;&#1083;-&gt;&#1048;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1089;&#1093;&#1077;&#1084;&#1099;. &#1045;&#1089;&#1083;&#1080; &#1042;&#1099; &#1091;&#1078;&#1077; &#1085;&#1077; &#1085;&#1072;&#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1083;&#1080;
&#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1076;&#1083;&#1103; &#1101;&#1090;&#1086;&#1081; &#1089;&#1093;&#1077;&#1084;&#1099;, &#1090;&#1086; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1086; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1077;
&#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;. &#1069;&#1090;&#1086; &#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;, &#1088;&#1080;&#1089;&#1091;&#1103; &#1083;&#1080;&#1085;&#1080;&#1080; &#1080; &#1076;&#1091;&#1075;&#1080;.
&#1055;&#1086;&#1089;&#1083;&#1077; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1080;&#1103;, &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1077; &#1077;&#1075;&#1086;. &#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1087;&#1086;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1077; &#1077;&#1075;&#1086; &#1085;&#1072; &#1076;&#1088;&#1091;&#1075;&#1091;&#1102; &#1089;&#1093;&#1077;&#1084;&#1091;, <span
 style="font-style: italic;">et voila</span>, &#1091; &#1042;&#1072;&#1089; &#1085;&#1086;&#1074;&#1086;&#1077; &#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;.
<br>
<br>
<a href="#top">&#1085;&#1072;&#1074;&#1077;&#1088;&#1093;</a><br>
</body>
</html>
